{
  "page": {
    "title": "Professional CV - João Victor Menezes"
  },
  "header": {
    "title": "Software Engineer"
  },
  "about": {
    "title": "About Me",
    "description": "Passionate software engineer with expertise in building scalable web applications and cloud based solutions. Strong background in full-stack development, with a focus on business applications. I have experience working on capital markets, e-commerce, education. Adept at collaborating with cross-functional teams to deliver high-quality software."
  },
  "experience": {
    "title": "Professional Experience",
    "job1": {
      "title": "Senior Software Engineer",
      "company": "Inoa Sistemas",
      "date": "2024 - Present",
      "location": "Rio de Janeiro, Brazil",
      "resp1": "Developed and maintained full-stack web applications using C#, Python, and React",
      "resp2": "Led the transition from a monolithic architecture to a microservices architecture transparently for clients",
      "resp3": "Make commercial presentations to clients, demonstrating new features and understanding usage contexts not yet covered by the solution",
      "resp4": "Mentored junior developers and conducted code reviews"
    },
    "job2": {
      "title": "Software Engineer",
      "company": "Inoa Sistemas",
      "date": "2023 - 2024",
      "location": "Rio de Janeiro, Brazil",
      "resp1": "Developed and maintained full-stack web applications using Python and React",
      "resp2": "Supported a product with dozens of asset management firms in the Brazilian capital markets",
      "resp3": "Created and maintained integrations with APIs from other financial market participants",
      "resp4": "Participated in architecture decisions and technical planning"
    },
    "job3": {
      "title": "Junior Technology Consultant",
      "company": "Visagio Consultoria",
      "date": "2023",
      "location": "Rio de Janeiro, Brazil",
      "resp1": "Built a book with strategic guidelines for the next 5 years of a large company in the education sector",
      "resp2": "Created models for choosing optimal locations for new physical units based on demographic and market data",
      "resp3": "Participated in daily meetings with the client and planning biweekly presentations to investors"
    },
    "job4": {
      "title": "Data Analysis Intern",
      "company": "ArtMed Panamericana",
      "date": "2019 - 2022",
      "location": "Remote",
      "resp1": "Analyzed large datasets to identify trends and actionable insights using Python and SQL",
      "resp2": "Built interactive dashboards for data visualization using PowerBi and Tableau",
      "resp3": "Acted as an internal consultant for data analysis in a medical education course marketplace"
    }
  },
  "education": {
    "title": "Education",
    "degree1": {
      "name": "Bachelor of Science in Cartographic Engineering",
      "institution": "Military Institute of Engineering - IME",
      "date": "2019 - 2023",
      "description": "Focus on Data Structures and Algorithms, Image Analysis, and Signal Processing."
    },
    "cert1": {
      "name": "MASTER Project",
      "institution": "Istituto di Scienza e Tecnologie dell'Informazione (ISTI-CNR)",
      "date": "2022"
    }
  },
  "skills": {
    "title": "Technical Skills",
    "languages": {
      "title": "Programming Languages"
    },
    "frontend": {
      "title": "Frontend"
    },
    "backend": {
      "title": "Backend"
    },
    "database": {
      "title": "Databases"
    },
    "cloud": {
      "title": "Cloud & DevOps"
    },
    "other": {
      "title": "Other"
    }
  },
  "languages": {
    "title": "Languages",
    "lang1": {
      "name": "Portuguese",
      "level": "Native"
    },
    "lang2": {
      "name": "English",
      "level": "Fluent"
    },
    "lang3": {
      "name": "Italian",
      "level": "Intermediate"
    }
  },
  "footer": {
    "text": "Thank you for reviewing my CV. I look forward to discussing opportunities with you."
  }
}
